{
  "name": "Übersicht: Item-Konfigurationen",
  "type": "JournalEntry",
  "_id": "kurzitems001",
  "pages": [
    {
      "_id": "kurzitpage003",
      "name": "Item-Konfigurationen - Übersicht",
      "type": "text",
      "title": {
        "show": true,
        "level": 1
      },
      "text": {
        "format": 1,
        "content": "<p>Das Ilaris-System bietet umfangreiche Möglichkeiten zur Konfiguration von Items. Diese Übersicht zeigt die wichtigsten Item-Typen und ihre Konfigurationsmöglichkeiten.</p>\r\n\r\n<h2>✨ Vorteile</h2>\r\n\r\n<h3>Zugriff</h3>\r\n<p>📦 <strong>Kompendium:</strong> \"Vorteile\" im Kompendium-Tab<br>\r\n➕ <strong>Hinzufügen:</strong> Drag & Drop auf Charakterbogen oder über \"+\" Button</p>\r\n\r\n<h3>📝 Konfigurationstipps für Vorteile</h3>\r\n<div style=\"background-color: #f0f8ff; padding: 10px; border-left: 4px solid #1e90ff; margin: 10px 0;\">\r\n<ul>\r\n    <li>Prüfe <strong>Voraussetzungen</strong> im Vorteilstext: Bei Vorteile sind die Voraussetzungen nur zur Zierede da, ES WIRD NICHT geprüft ob eine Voraussetzungen erfüllt ist! Dafür ist Sephrasto zuständig.</li>\r\n    <li>Genauso wenig haben die EP-Kosten Auswirkung auf den Charakter in Foundry</li>\r\n    <li>Kampfstil-Vorteile:\r\n        <ul>\r\n            <li><strong>Sephrasto Script Parameter:</strong> Steht in Foundry nur den Kampfstil-Vorteilen zur Verfügung. z.B.: modifyKampfstil('Beidhändiger Kampf', 1, 0, 0, 0), das Script macht genau das gleiche wie in Sephrasto auch, also modifiyKampfstil('Name(ist in foundry selbst eher unwichtig)',AT,VT,TP,RW,BE)</li>\r\n            <li>Die Stilbedingungen bestimmen, welche Voraussetzungen erfüllt sein müssen, damit der Kampfstil aktiv ist:\r\n                <ul>\r\n                    <li><strong>Leeres Feld:</strong> Kampfstil ist immer aktiv</li>\r\n                    <li><strong>Reittier:</strong> 'beritten' oder 'nicht beritten'</li>\r\n                    <li><strong>Trennung:</strong> Einzelne Bedingungen mit Komma trennen<br><em>Beispiel: 'beritten, Schild'</em></li>\r\n                    <li><strong>Waffeneigenschaften:</strong> Direkt angeben<br><em>Beispiele: 'Schild', 'Parierwaffe', 'Wendig'</em></li>\r\n                    <li><strong>Waffentypen:</strong>'Nahkampfwaffe' oder 'Fernkampfwaffe','einzelne Nahkampfwaffe' = nur eine Nahkampfwaffe,'zwei einhändige Nahkampfwaffen' = zwei Waffen</li>\r\n                    <li><strong>man kann Kampfstile auch auf Fertigkeiten einschränken:</strong> 'Fertigkeit <Name>'<em>Beispiel: 'Fertigkeit Wurfwaffen'</em></li>\r\n                </ul>\r\n            </li>\r\n            <li>Verfügbare Foundry-Scripts für Kampfstil-Modifikationen.</p>\r\n                <ul>\r\n                    <li>\r\n                        <strong>ignoreSideWeaponMalus(Eigenschaft)</strong><br>\r\n                        <em>Ignoriert Erschwernisse für Nebenwaffe</em><br>\r\n                        <small>Parameter: Eigenschaft (optional)</small><br>\r\n                        <code style='padding: 2px 4px; font-size: 11px;'>ignoreSideWeaponMalus('Wendig')</code>\r\n                    </li>\r\n                    <li>\r\n                        <strong>affectsRangedWeaponOnly()</strong><br>\r\n                        <em>Modifier wirken nur auf Fernkampfwaffen: in Sephrasto und ohne dieses Foundry-Script wirken sich die Modifier von modifiyKampfstil nur auf Nahkampfwaffen aus. Dieses Script bewirkt, dass sich ALLE Modifier nur auf Fernkampfwaffen auswirken. Damit ist es möglich auch Fernkampfstile zu haben.</em><br>\r\n                        <small>Keine zusätzlichen Parameter</small><br>\r\n                        <code style='padding: 2px 4px; font-size: 11px;'>affectsRangedWeaponOnly()</code>\r\n                    </li>\r\n                    <li>\r\n                        <strong>ignoreMountedRangePenalty()</strong><br>\r\n                        <em>Ignoriert Fernkampf-Malus beim Reiten</em><br>\r\n                        <small>Keine zusätzlichen Parameter</small><br>\r\n                        <code style='padding: 2px 4px; font-size: 11px;'>ignoreMountedRangePenalty()</code>\r\n                    </li>\r\n                    <li>\r\n                        <strong>manoverAusgleich(Wert)</strong><br>\r\n                        <em>Setzt Manöverausgleich für Kampfstil: Deckt für Ilaris zum Beispiel den Vorteil von Parierwaffenkampf ab. Kommt erst im Kampfdialog zum Tragen und nur wenn auch Manöver ausgewählt sind. Im Script kann noch ein false mit gegeben werden (per default benutzt das Script true), dieser Parameter bewirkt, dass sich die Manövererleichterung auf alle Manöver auswirkt und nicht nur Basis-Manöver.</em><br>\r\n                        <small>Parameter: Wert = Manöverausgleichwert (Zahl), Auswirkung auf alle Manöver/Basis-Manöver: true/false (default ist true)</small><br>\r\n                        <code style='padding: 2px 4px; font-size: 11px;'>manoverAusgleich(2)</code>\r\n                    </li>\r\n                </ul>\r\n                <strong>⚠️ Mehrere Methoden mit Semikolon trennen</strong>\r\n            </li>\r\n        </ul>\r\n    </li>\r\n    <li>Andere Vorteile benutzen die Active Effekts Mechanik von Foundry, um ihre Boni auf den Charakter zu bringen. Zur Zeit sind das nur Statische Effekte ohne weitere Einschränkungen z.B. Unverwündlich mit +1WS funktioniert, Eindrucksvoll I mit Bonus +2 in Rededuellen funktioniert nicht! Um Effekte zu verändern oder hinzuzufügen, sollte man sich mal https://foundryvtt.com/article/active-effects/ oder eine Anleitung von DnD zum Thema anschauen https://github-wiki-see.page/m/foundryvtt/dnd5e/wiki/Active-Effect-Guide . Grundsätzlich können alle Keys, die sich im System des Charakters befinden benutzt werden, schaut dazu in die template.json. <strong>Beim Import von Vorteilen mit dem XML Import aus Sephrasto:</strong> Wenn man Vorbildhaft in Sephrasto modifyGS/DH/... verwendet hat werden diese Scripte in Foundry in Effekte umgewandelt.</li>\r\n</ul>\r\n</div>\r\n\r\n<h2>⚔️ Manöver (Manöver)</h2>\r\n\r\n<h3>Zugriff</h3>\r\n<p>Manöver stehen einem Actor (Helden und Kreaturen) automatisch im Kampfdialog zur Verfügung, wenn die Voraussetzungen dafür erfüllt sind! Kreaturen ignorieren die Voraussetzungen für Übernatürliche Manöver (in Sephrasto ist das IMMER eine Tradition oder Zauberer). Außerdem kommen die übernatürlichen Vorteile WIE in Sephrasto auch mit dem Zusatz L/M vor, falls Dopplungen bestehen zb. Kosten Sparen!</p>\r\n\r\n<h3>Manöver-Kategorien</h3>\r\n<p>In Foundry kommen die Manöver in folgenden Kategorien vor, die sich jeweils an den Kategorien aus Sephrasto anlehnen, mit dem Zusatz von Verteidigungsmanövern:</p>\r\n<ul>\r\n<li>Nahkampfmanöver</li>\r\n<li>Fernkampfmanöver</li>\r\n<li>Magische Manöver</li>\r\n<li>Liturgische Manöver</li>\r\n<li>AnrufungsManöver</li>\r\n<li>Verteidigungsmanöver</li>\r\n</ul>\r\n\r\n<h3>📝 Konfigurationstipps für Manöver</h3>\r\n<div style=\"background-color: #f0f8ff; padding: 10px; border-left: 4px solid #1e90ff; margin: 10px 0;\">\r\n<ul>\r\n<li>Manöver haben oft spezifische <strong>Voraussetzungen</strong> (Vorteile, Waffeneigenschaften): Es MUSS auf die korrekte Schreibweise geachtet werden, sonst steht das Manöver möglicherweise nicht zur Verfügung!</li>\r\n<li>Für die Automatisierung von Manövern können Manöver-Modifikationen verwendet werden, diese funktionieren wie folgt:\r\n    <ul>\r\n        <li><strong>Input:</strong> Manöver haben können eine von 3 Inputmöglichkeiten haben. Entweder ein Inputfeld für Zahlen (mit min und max, max leer lassen, bedeutet, dass man keine obere Grenze hat), eine Checkbox oder ein Dropdown-Menü mit den Trefferzonen.</li>\r\n        <li><strong>Modifikatoren</strong>, bestimmen wie das Manöver beim Auswählen verhalten soll:\r\n            <ul>\r\n                <li>Modifikatortyp, gibt an was auf welchen Stat sich das Manöver auswirkt, zB. kann mit 'Angriff,Fernkampf,Übernatürliche Fertigkeit' der 'Angriffs'-Probenwert beeinflusst werden. Die folgenden Typen haben eine Implementierung im System:\r\n                    <ul>\r\n                        <li>Angriff,Fernkampf,Übernatürliche Fertigkeit: Angriff-Probenwert</li>\r\n                        <li>Schaden: TP für Nahkampfangriffe und Fernkampfangriffe, hat keine Auswirkung auf Übernatürliche Talente</li>\r\n                        <li>Verteidigung: Wirkt nur auf den VT-Wert bei Nahkampfangriffen</li>\r\n                        <li>Resource für Zauber/Liturgie: beeinflusst die jeweilige Energie beim Einsatz von übernatürlichen Talenten</li>\r\n                        <li>Waffenschaden: Speziell ist hier Waffenschaden gemeint zB. für Hammerschlag</li>\r\n                        <li>Kein Schaden: Lässt das Manöver 0 Schaden anrichten und macht andere ähnliche Manöver nicht selektierbar</li>\r\n                        <li>Spezialeffekt: kann bei allen Manövern verwendet werden und gibt im Chat einfach nur Text aus, was das Manöver spezielles macht. ZB hat das Manöver Rüstungsbrecher den Spezialeffekt, dass es Rüstung ignoriert. Was dann im Chat so ausgegeben wird.</li>\r\n                    </ul>\r\n                </li>\r\n            </ul>\r\n            <p>Allgemein finden sich in den Manövern wohl alle möglichen Kombinationen von Input und Modifikatoren wieder. Falls man selbst eines erstellt, kann man sich hier an den Vorhandenen orientieren. Beim XML-Import von Sephrasto für Hausregeln werden viele Modifikationen schon automatisch gesetzt, das ganze sollte aber auf jeden Fall auf seine Richtigkeit überprüft werden, da der Importer nur rudimentär bzw klassisch über Regex an das Ganze herangeht.</p>\r\n        </li>\r\n        <li>Operatoren umfassen: Addieren, Subtrahieren, Multiplizieren und Dividieren. Punkt wird vor Strich verrechnet!</li>\r\n        <li>Target: In diesem Feld kann man den Key eines Wertes im System des Actors angeben, also zb actor.system.abgeleitete.be, um den Wert für Behinderung zu bekommen. Dieser Wert wird dann entsprechend mit dem jeweiligen Operator als Modifikator verwendet</li>\r\n        <li>Die Checkbox ganz am Ende \"Wird von Input beeinflusst\", ist nur für das Inputfeld mit Zahlen wichtig und gibt an, dass der Modifikator mit der Zahl im Inputfeld multipliziert wird.</li>\r\n    </ul>\r\n</li>\r\n<li>Im Kampfdialog können verfügbare Manöver direkt ausgewählt werden</li>\r\n</ul>\r\n</div>\r\n\r\n\r\n<h2>Waffeneigenschaften</h2>\r\n<p>📦 <strong>Kompendium:</strong> \"Waffeneigenschaften\"</p>\r\n\r\n<h4>Wichtige Punkte für Waffeneigenschaften</h4>\r\n<p>Waffeneigenschaften können in Foundry individuell gestaltet werden. Hier sind einige Eckpunkte für die Erstellung.</p>\r\n<p>\r\n    <strong>Kategorie</strong>, gibt allgemein vor, um welche Art von Eigenschaft es sich handelt. Zur Zeit gibt es die folgenden Kategorien:\r\n    <ul>\r\n        <li>Modifikator: Damit kann die Waffe direkt noch mit einer erhöhten Patzer/Crit Chance oder einem Wert im System des Actors modifiziert werden, der Wert wird hier in der Formel abgerundet Wert/4 verwendet, dadurch lässt sich zb Kopflastig über @actor.system.attribute.KK.wert abdecken.</li>\r\n        <li>Führung: Hierunter fallen zb die Waffeneigenschaften 'Zweihändig' oder 'Schwer', also Waffeneigenschaften die je nach nicht sachgemäßer Führung bestimmte Auswirkungen haben. Hier kann auch gesetzt werden ob eine Waffe 'kein Malus als Nebenwaffe' hat oder ein Reittier erfordert oder nur ohne Reittier geführt werden kann.</li>\r\n        <li>Akteur-Modifikator: Hiermit kann die Waffeneigenschaft direkt einen dieser Werte auf dem Actor modifizieren oder setzen BE,GS,INI. Damit kann man zum Beispiel von einem Reittier die GS des Actors auf einen neuen Wert setzen oder weiter modifizeren.</li>\r\n        <li>Ziel-Effekt: noch nicht implementiert!</li>\r\n        <li>Passiv: Ist einfach nur eine Passive Waffeneigenschaft wie Schild oder Parierwaffe, die an sich keine direkten Auswirkungen auf die Waffe oder den Acotr haben</li>\r\n    </ul>\r\n</p>\r\n<p></p>\r\n\r\n\r\n</div>\r\n"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "sort": 0,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_key": "!journal.pages!kurzitems001.kurzitpage003"
    }
  ],
  "folder": null,
  "sort": 0,
  "ownership": {
    "default": 0
  },
  "flags": {},
  "_stats": {
    "coreVersion": "12.331",
    "systemId": null,
    "systemVersion": null,
    "createdTime": null,
    "modifiedTime": null,
    "lastModifiedBy": null,
    "compendiumSource": null,
    "duplicateSource": null
  },
  "_key": "!journal!kurzitems001"
}