{
  "name": "Hexenflüche",
  "type": "uebernatuerliche_fertigkeit",
  "img": "systems/Ilaris/assets/images/skills/magic-skill.svg",
  "system": {
    "basis": 0,
    "fw": 0,
    "pw": 0,
    "attribut_0": "CH",
    "attribut_1": "IN",
    "attribut_2": "MU",
    "gruppe": 0,
    "text": "Als Hexe hast du zwei Möglichkeiten, deine Flüche zu überbringen. Entweder du schleuderst sie direkt lautstark auf das Opfer, wodurch du häufig vom Bonus der Hexischen Repräsentation II profitieren kannst, oder du lässt den Fluch unauffällig von deinem Vertrauten überbringen. Dafür benötigst du allerdings ein Körperteil (z.B. Haar) deines Opfers. In beiden Fällen legst du danach die Probe auf eine passende übernatürliche Fertigkeit ab. Jeder Hexenfluch kann auch permanent gesprochen werden. Das verdoppelt die Kosten und ein Achtel der AsP halten als gAsP den Fluch aufrecht. Neben Antimagie oder göttlichem Wirken kann ein permanenter Fluch immer auch durch das Erfüllen einer Bedingung beendet werden. Diese Bedingung muss realistisch erfüllbar sein und du musst sie dem Verfluchten mitteilen (direkter Fluch) oder er erfährt sie in seinen Träumen (überbrachter Fluch).\n\n  Neben den als Talente aufgelisteten Beispielen sollen die Töchter Satuarias zahlreiche weitere Flüche kennen, die Unfruchtbarkeit und Krankheit über Mensch und Tier bringen und Ernten zerstören können. Sogar von einem Todesfluch wird gemunkelt, der sein Opfer langsam, aber unaufhaltsam auszehrt.\n\n  Jede Hexe kann auf einem Besen oder einem anderen Holzgegenstand reiten. Dazu erhält sie bei der halbjährlichen Hexennacht die Hexensalbe, mit der das bestrichene Objekt flugfähig ist. Die Aktivierung des Besens vor jedem Flug kostet 1 AsP. Tollkühne Flugmanöver erfordern Proben auf das Talent Akrobatik. Misslungene Proben bedeuten, dass die Hexe die Kontrolle über den Besen verliert und schlimmstenfalls unsanft notlanden muss. Bei einem Patzer kann der Hexe der Absturz drohen, sie könnte aber auch den Zorn eines Drachen geweckt haben.",
    "voraussetzung": "Vorteil Tradition der Hexen I"
  },
  "effects": [],
  "folder": null,
  "sort": 0,
  "flags": {},
  "_id": "5UNa9f7axzEImGGX",
  "_stats": {
    "coreVersion": "12.331",
    "systemId": null,
    "systemVersion": null,
    "createdTime": null,
    "modifiedTime": null,
    "lastModifiedBy": null,
    "compendiumSource": null,
    "duplicateSource": null
  },
  "ownership": {
    "default": 0,
    "b5zxAh2tnhbWdvfZ": 3
  },
  "_key": "!items!5UNa9f7axzEImGGX"
}
